src/ex_Tabakon/Documents/ТБК_ВедомостьОПродажахЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТБК_ВедомостьОПродажахЗаДень</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено_ПКО</Name>
					<Comment>:</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажнеНеУчтено_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоБанковскимКартам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяБезНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличныеКСдаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продаца_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаКакуюДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыОРозничныхПродажах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтчетОРозничныхПродажах</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПоБанковскимКартам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаНаличными</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяБезНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыемкаДенежныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выемка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продавцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПродавца</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТБКТипыПродавцов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяСмены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродавецНаЗамену</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры5000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры2000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ТБКСменыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТБКСменыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипПродавца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТБКТипыПродавцов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродавецНаЗамену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Enums/ТБКТипыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТБКТипыПродавцов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВторойПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МладшийПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НочнойПродавец</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/ТБК_ВедомостьОПродажахЗаДень/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Статья ДДС для реквизита «Приложение» РКО на оплату поставщику: по этой строке ордер разносится в УТ.
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьСтатьяДДСОплатаПоставщику() Экспорт
	Возврат "2.1.а Оплата поставщику ВЫРУЧКА";
КонецФункции

// Статья ДДС для реквизита «Приложение» ПКО неучтенной выручки.
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьСтатьяДДСНеучтенка() Экспорт
	Возврат "1.4 Торговая выручка - НЕУЧТЕНКА";
КонецФункции

// Статья ДДС для реквизита «Приложение» ПКО наличной выручки по выемке.
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьСтатьяДДСНал() Экспорт
	Возврат "1.1 Торговая розничная выручка - НАЛ";
КонецФункции

// Заполняет ведомость по документам кассы ККМ с момента предыдущей ведомости этой кассы:
// отчеты о розничных продажах, суммы выручки и возвратов, выемки, продавцов закрытых смен.
// Если выемок за период нет, а наличные были, создает выемки по отчетам о продажах.
// Кассовые ордера не создает - это делает запись ведомости.
//
// Параметры:
//  Ведомость - ДокументОбъект.ТБК_ВедомостьОПродажахЗаДень - ведомость с заполненной кассой ККМ.
//
Процедура ЗаполнитьПоДаннымКассы(Ведомость) Экспорт

	// Пока ведомость не записана, период идет до текущего момента, после записи - до ее даты,
	// чтобы повторное заполнение не захватило документы следующей смены.
	ДатаКонца = ?(Ведомость.Ссылка.Пустая(), ТекущаяДатаСеанса(), Ведомость.Дата);

	Запрос = Новый Запрос(ТекстЗапросаДанныхКассы());
	Запрос.УстановитьПараметр("КассаККМ", Ведомость.КассаККМ);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаПредыдущейВедомости(Ведомость, ДатаКонца));
	Запрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	Запрос.УстановитьПараметр("Неучтенка", ПолучитьСтатьяДДСНеучтенка());
	Результаты = Запрос.ВыполнитьПакет();

	// Номера результатов пакета описаны в ТекстЗапросаДанныхКассы.
	ОтчетыОПродажах = Результаты[1].Выгрузить();
	Ведомость.ОтчетыОРозничныхПродажах.Загрузить(ОтчетыОПродажах);
	Ведомость.Продавцы.Загрузить(Результаты[2].Выгрузить());
	ЗаполнитьСуммыВыручки(Ведомость, ОтчетыОПродажах, СуммаИзРезультата(Результаты[4]), СуммаИзРезультата(Результаты[5]));

	Выемки = Результаты[6].Выгрузить();
	// Вик 2026-08-24: если выемку не сделали, создаем ее сами по наличным каждого отчета.
	Если Выемки.Количество() = 0 И Ведомость.ОплатаНаличными > 0 Тогда
		СоздатьНедостающиеВыемки(ОтчетыОПродажах, Выемки);
	КонецЕсли;
	Ведомость.ВыемкаДенежныхСредств.Загрузить(Выемки);

КонецПроцедуры

// Создает и проводит выемку наличных по отчету о розничных продажах.
//
// Параметры:
//  ОтчетОРозничныхПродажах - ДокументСсылка.ОтчетОРозничныхПродажах - отчет, по которому делается выемка.
//  Сумма - Число - сумма выемки.
//
// Возвращаемое значение:
//  ДокументСсылка.ВыемкаДенежныхСредствИзКассыККМ - созданная выемка.
//
Функция СоздатьВыемкуПоОтчету(ОтчетОРозничныхПродажах, Сумма) Экспорт

	РеквизитыОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтчетОРозничныхПродажах, "Дата, Организация, КассаККМ, Магазин");
	РеквизитыОтчета.Вставить("ОтчетОРозничныхПродажах", ОтчетОРозничныхПродажах);

	Возврат СоздатьВыемку(РеквизитыОтчета, Сумма);

КонецФункции

// Ставит тип «Основной продавец» строкам, где тип не указан.
// У магазинов с двумя кассами тип продавца иногда не заполняется (Толстоухов 24.03.2026).
//
// Параметры:
//  Ведомость - ДокументОбъект.ТБК_ВедомостьОПродажахЗаДень - записываемая ведомость.
//
Процедура ЗаполнитьТипПродавцаПоУмолчанию(Ведомость) Экспорт

	ОсновнойПродавец = Перечисления.ТБКТипыПродавцов.ОсновнойПродавец;
	Для Каждого СтрокаТаблицы Из Ведомость.Продавцы Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ТипПродавца) Тогда
			СтрокаТаблицы.ТипПродавца = ОсновнойПродавец;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Проверяет ведомость перед записью. Сообщения привязаны к полям формы документа.
//
// Параметры:
//  Ведомость - ДокументОбъект.ТБК_ВедомостьОПродажахЗаДень - записываемая ведомость.
//  Отказ - Булево - устанавливается в Истина, если записывать нельзя.
//  ЭтоАвтосохранение - Булево - запись формой без кассира: при открытии новой ведомости и при закрытии окна.
//
Процедура ПроверитьПередЗаписью(Ведомость, Отказ, ЭтоАвтосохранение = Ложь) Экспорт

	// Продавцов и отчеты при автосохранении не проверяем, как и до ревью: иначе ведомость смены
	// не сохранится, а следующая ведомость кассы заберет и эту смену.
	Если Не ЭтоАвтосохранение Тогда
		ПроверитьПродавцов(Ведомость, Отказ);
		Если Ведомость.ОтчетыОРозничныхПродажах.Количество() = 0 Тогда
			СообщитьОбОшибке(НСтр("ru = 'Не заполнены отчеты о розничных продажах.'"), "ОтчетыОРозничныхПродажах", Отказ);
		КонецЕсли;
	КонецЕсли;

	// Остальное проверяем при любой записи: по этим данным создаются кассовые ордера.
	Если ЗначениеЗаполнено(Ведомость.ВедомостьПродажНеУчтено)
		И Не ЗначениеЗаполнено(Ведомость.ВедомостьПродажНеУчтено_ПКО)
		И Ведомость.ВыемкаДенежныхСредств.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'По кассе ККМ %1 нет зарегистрированной выемки, а ПКО (не учтено) привязывается к выемке.'"),
			Ведомость.КассаККМ);
		СообщитьОбОшибке(ТекстСообщения, "ВедомостьПродажНеУчтено", Отказ);
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из Ведомость.ОплатаПоставщику Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Сумма) И Не ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
			СообщитьОбОшибке(НСтр("ru = 'Не указан поставщик.'"), ПолеСтроки("ОплатаПоставщику", СтрокаТаблицы, "Контрагент"), Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Приводит кассовые ордера ведомости в соответствие с ее суммами: создает недостающие,
// обновляет сумму и поставщика у созданных, помечает на удаление ордера обнуленных сумм
// и удаленных строк оплаты поставщикам. Вызывается из ПередЗаписью ведомости, то есть внутри
// транзакции ее записи: при отказе записи созданные ордера откатываются вместе с ней.
//
// Параметры:
//  Ведомость - ДокументОбъект.ТБК_ВедомостьОПродажахЗаДень - записываемая ведомость.
//
Процедура СинхронизироватьКассовыеОрдера(Ведомость) Экспорт

	Контекст = НовыйКонтекстОрдеров(Ведомость);
	Контекст.СостояниеОрдеров = СостояниеСвязанныхОрдеров(Ведомость);

	// Ордер создается на каждую строку без ПКО - это запись документа;
	// касса и статьи ДДС читаются один раз и берутся из контекста.
	Для Каждого СтрокаТаблицы Из Ведомость.ВыемкаДенежныхСредств Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ПКО) Тогда
			СтрокаТаблицы.ПКО = СоздатьКассовыйОрдер(Контекст,
				ОписаниеПКОВыручки(Ведомость, СтрокаТаблицы.Выемка), СтрокаТаблицы.Сумма);
		КонецЕсли;
	КонецЦикла;

	ПометитьНаУдалениеРКОУдаленныхСтрок(Ведомость);
	Для Каждого СтрокаТаблицы Из Ведомость.ОплатаПоставщику Цикл
		СтрокаТаблицы.РКО = АктуальныйКассовыйОрдер(Контекст,
			СтрокаТаблицы.РКО, СтрокаТаблицы.Сумма, ОписаниеРКОПоставщику(СтрокаТаблицы.Контрагент));
	КонецЦикла;

	Ведомость.РасходыОтдела_РКО = АктуальныйКассовыйОрдер(Контекст,
		Ведомость.РасходыОтдела_РКО, Ведомость.РасходыОтдела, ОписаниеРКОРасходовОтдела(Ведомость));
	Ведомость.ЗП_Продавца_РКО = АктуальныйКассовыйОрдер(Контекст,
		Ведомость.ЗП_Продавца_РКО, Ведомость.ЗП_Продавца, ОписаниеРКОЗарплаты(Ведомость));
	Ведомость.ВедомостьПродажНеУчтено_ПКО = АктуальныйКассовыйОрдер(Контекст,
		Ведомость.ВедомостьПродажНеУчтено_ПКО, Ведомость.ВедомостьПродажНеУчтено, ОписаниеПКОНеучтено(Ведомость));

КонецПроцедуры

// Проводит связанные кассовые ордера, которые остались непроведенными,
// например записанные прежней версией ведомости. Проведенные не перепроводит.
// РКО на зарплату продавца не проводится - так было и до ревью.
//
// Параметры:
//  Ведомость - ДокументОбъект.ТБК_ВедомостьОПродажахЗаДень - записываемая ведомость.
//
Процедура ПровестиСвязанныеКассовыеОрдера(Ведомость) Экспорт

	ПКО = Ведомость.ВыемкаДенежныхСредств.ВыгрузитьКолонку("ПКО");
	ПКО.Добавить(Ведомость.ВедомостьПродажНеУчтено_ПКО);
	РКО = Ведомость.ОплатаПоставщику.ВыгрузитьКолонку("РКО");
	РКО.Добавить(Ведомость.РасходыОтдела_РКО);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПКО.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПКО
	|ГДЕ
	|	ПКО.Ссылка В (&ПКО)
	|	И НЕ ПКО.Проведен
	|	И НЕ ПКО.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РКО.Ссылка
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РКО
	|ГДЕ
	|	РКО.Ссылка В (&РКО)
	|	И НЕ РКО.Проведен
	|	И НЕ РКО.ПометкаУдаления");
	Запрос.УстановитьПараметр("ПКО", ПКО);
	Запрос.УстановитьПараметр("РКО", РКО);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОрганизацияКассыККМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость.КассаККМ, "Владелец");
	Контекст = НовыйКонтекстОрдеров(Ведомость);
	Пока Выборка.Следующий() Цикл
		Ордер = Выборка.Ссылка.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(Ордер.Организация) Тогда
			Ордер.Организация = ОрганизацияКассыККМ;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Ордер.Касса) Тогда
			Ордер.Касса = КассаОрганизации(Контекст).Ссылка;
		КонецЕсли;
		Ордер.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заполнение

Функция ДатаПредыдущейВедомости(Ведомость, ДатаКонца)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ведомости.Дата КАК Дата
	|ИЗ
	|	Документ.ТБК_ВедомостьОПродажахЗаДень КАК Ведомости
	|ГДЕ
	|	Ведомости.КассаККМ = &КассаККМ
	|	И Ведомости.Дата <= &ДатаКонца
	|	И Ведомости.Ссылка <> &Ссылка
	|	И НЕ Ведомости.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ведомости.Дата УБЫВ");
	Запрос.УстановитьПараметр("КассаККМ", Ведомость.КассаККМ);
	Запрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	Запрос.УстановитьПараметр("Ссылка", Ведомость.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	КонецЕсли;

	// Первая ведомость кассы - как до ревью: с начала дня ведомости. У новой, еще не записанной
	// ведомости дата пустая, и период идет с начала истории кассы.
	Возврат НачалоДня(Ведомость.Дата);

КонецФункции

// Пакет запросов по документам кассы за период:
//  0 - ВТОтчеты: проведенные отчеты о розничных продажах с суммами оплат и возвратов по картам;
//  1 - отчеты для табличной части ОтчетыОРозничныхПродажах и для создания выемок;
//  2 - продавцы смен этих отчетов;
//  3 - ВТВозвраты: проведенные возвраты от покупателя (по чекам прошлых смен);
//  4, 5 - сколько по ним выдано наличными и возвращено на карты: как и раньше, по одному
//         ордеру на возврат, при нескольких - наибольший;
//  6 - выемки с их ПКО выручки (ПКО неучтенки к выемке тоже привязан, его исключаем).
//
Функция ТекстЗапросаДанныхКассы()

	Возврат
	"ВЫБРАТЬ
	|	Отчеты.Ссылка КАК ОтчетОРозничныхПродажах,
	|	Отчеты.Дата КАК Дата,
	|	Отчеты.Организация КАК Организация,
	|	Отчеты.КассаККМ КАК КассаККМ,
	|	Отчеты.Магазин КАК Магазин,
	|	Отчеты.КассоваяСмена КАК КассоваяСмена,
	|	Отчеты.СуммаОплатыНаличных КАК ОплатаНаличными,
	|	Отчеты.СуммаВозвратов КАК СуммаВозвратов,
	|	СУММА(ВЫБОР
	|			КОГДА ОплатыКартами.Сумма > 0
	|				ТОГДА ОплатыКартами.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОплатаПоБанковскимКартам,
	|	СУММА(ВЫБОР
	|			КОГДА ОплатыКартами.Сумма < 0
	|				ТОГДА -ОплатыКартами.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВозвратОтПокупателяБезНал
	|ПОМЕСТИТЬ ВТОтчеты
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК Отчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОплатыКартами
	|		ПО (ОплатыКартами.Ссылка = Отчеты.Ссылка)
	|ГДЕ
	|	Отчеты.КассаККМ = &КассаККМ
	|	И Отчеты.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И Отчеты.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Отчеты.Ссылка,
	|	Отчеты.Дата,
	|	Отчеты.Организация,
	|	Отчеты.КассаККМ,
	|	Отчеты.Магазин,
	|	Отчеты.КассоваяСмена,
	|	Отчеты.СуммаОплатыНаличных,
	|	Отчеты.СуммаВозвратов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОтчеты.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах,
	|	ВТОтчеты.Дата КАК Дата,
	|	ВТОтчеты.Организация КАК Организация,
	|	ВТОтчеты.КассаККМ КАК КассаККМ,
	|	ВТОтчеты.Магазин КАК Магазин,
	|	ВТОтчеты.ОплатаНаличными КАК ОплатаНаличными,
	|	ВТОтчеты.ОплатаПоБанковскимКартам КАК ОплатаПоБанковскимКартам,
	|	ВТОтчеты.ВозвратОтПокупателяБезНал КАК ВозвратОтПокупателяБезНал,
	|	ВТОтчеты.СуммаВозвратов - ВТОтчеты.ВозвратОтПокупателяБезНал КАК ВозвратОтПокупателяНал
	|ИЗ
	|	ВТОтчеты КАК ВТОтчеты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТОтчеты.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Смены.Продавец КАК Продавец,
	|	Смены.ТипПродавца КАК ТипПродавца,
	|	Смены.ВремяСмены КАК ВремяСмены,
	|	Смены.ПродавецНаЗамену КАК ПродавецНаЗамену
	|ИЗ
	|	ВТОтчеты КАК ВТОтчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТБКСменыСотрудников КАК Смены
	|		ПО (Смены.КассоваяСмена = ВТОтчеты.КассоваяСмена)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТОтчеты.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Возвраты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК Возвраты
	|ГДЕ
	|	Возвраты.КассаККМ = &КассаККМ
	|	И Возвраты.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И Возвраты.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ПоВозвратам.Сумма), 0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		РКО.ДокументОснование КАК Возврат,
	|		МАКСИМУМ(РКО.СуммаДокумента) КАК Сумма
	|	ИЗ
	|		Документ.РасходныйКассовыйОрдер КАК РКО
	|	ГДЕ
	|		РКО.Проведен
	|		И РКО.ДокументОснование В
	|				(ВЫБРАТЬ
	|					ВТВозвраты.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТВозвраты КАК ВТВозвраты)
	|
	|	СГРУППИРОВАТЬ ПО
	|		РКО.ДокументОснование) КАК ПоВозвратам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ПоВозвратам.Сумма), 0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		Оплаты.ДокументОснование КАК Возврат,
	|		МАКСИМУМ(Оплаты.СуммаДокумента) КАК Сумма
	|	ИЗ
	|		Документ.ОплатаОтПокупателяПлатежнойКартой КАК Оплаты
	|	ГДЕ
	|		Оплаты.Проведен
	|		И Оплаты.ДокументОснование В
	|				(ВЫБРАТЬ
	|					ВТВозвраты.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТВозвраты КАК ВТВозвраты)
	|
	|	СГРУППИРОВАТЬ ПО
	|		Оплаты.ДокументОснование) КАК ПоВозвратам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выемки.Ссылка КАК Выемка,
	|	Выемки.СуммаДокумента КАК Сумма,
	|	ПКО.Ссылка КАК ПКО
	|ИЗ
	|	Документ.ВыемкаДенежныхСредствИзКассыККМ КАК Выемки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПКО
	|		ПО (ПКО.ДокументОснование = Выемки.Ссылка)
	|			И (НЕ ПКО.ПометкаУдаления)
	|			И (ПКО.Приложение <> &Неучтенка)
	|ГДЕ
	|	Выемки.КассаККМ = &КассаККМ
	|	И Выемки.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И Выемки.Проведен
	|	И Выемки.СуммаДокумента <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выемки.Дата";

КонецФункции

Функция СуммаИзРезультата(РезультатЗапроса)

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	Возврат 0;

КонецФункции

Процедура ЗаполнитьСуммыВыручки(Ведомость, Знач ОтчетыОПродажах, Знач ВыданоНаличными, Знач ВозвращеноНаКарты)

	ВозвратНаКартыВСменах = ОтчетыОПродажах.Итог("ВозвратОтПокупателяБезНал");

	Ведомость.ОплатаНаличными = ОтчетыОПродажах.Итог("ОплатаНаличными");
	Ведомость.ОплатаПоБанковскимКартам = ОтчетыОПродажах.Итог("ОплатаПоБанковскимКартам") - ВозвратНаКартыВСменах;
	Ведомость.ВыручкаЗаСменуПоКассе = Ведомость.ОплатаНаличными + Ведомость.ОплатаПоБанковскимКартам;

	// Вик 2021-11-15: возвраты по отдельным документам возврата в выручку не входят и показываются отдельно.
	Ведомость.ВозвратОтПокупателяНал = ВыданоНаличными;
	Ведомость.ВозвратОтПокупателяБезНал = ВозвращеноНаКарты;

КонецПроцедуры

Процедура СоздатьНедостающиеВыемки(Знач ОтчетыОПродажах, Выемки)

	Для Каждого Отчет Из ОтчетыОПродажах Цикл

		Если Отчет.ОплатаНаличными <= 0 Тогда
			Продолжить;
		КонецЕсли;

		// Заполнение идет вне транзакции: одна неудачная выемка не должна мешать остальным.
		Попытка
			Выемка = СоздатьВыемку(Отчет, Отчет.ОплатаНаличными);
		Исключение
			ИнформацияОшибки = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ТБК_ВедомостьОПродажахЗаДень, Отчет.ОтчетОРозничныхПродажах,
				ПодробноеПредставлениеОшибки(ИнформацияОшибки));
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось создать выемку по отчету %1: %2'"),
				Отчет.ОтчетОРозничныхПродажах, КраткоеПредставлениеОшибки(ИнформацияОшибки));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;

		НоваяСтрока = Выемки.Добавить();
		НоваяСтрока.Выемка = Выемка;
		НоваяСтрока.Сумма = Отчет.ОплатаНаличными;

	КонецЦикла;

КонецПроцедуры

// Параметры:
//  РеквизитыОтчета - Структура, СтрокаТаблицыЗначений - Дата, Организация, КассаККМ, Магазин
//                    и ОтчетОРозничныхПродажах отчета, по которому делается выемка.
//  Сумма - Число - сумма выемки.
//
Функция СоздатьВыемку(Знач РеквизитыОтчета, Знач Сумма)

	Выемка = Документы.ВыемкаДенежныхСредствИзКассыККМ.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Выемка, РеквизитыОтчета, "Дата, Организация, КассаККМ, Магазин, ОтчетОРозничныхПродажах");
	Выемка.СуммаДокумента = Сумма;
	Выемка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствИзКассыККМ;
	Выемка.Записать(РежимЗаписиДокумента.Проведение);

	Возврат Выемка.Ссылка;

КонецФункции

#КонецОбласти

#Область Проверки

Процедура ПроверитьПродавцов(Ведомость, Отказ)

	Если Ведомость.Продавцы.Количество() = 0 Тогда
		СообщитьОбОшибке(НСтр("ru = 'Не заполнены продавцы.'"), "Продавцы", Отказ);
		Возврат;
	КонецЕсли;

	ПервыеСтрокиПродавцов = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Ведомость.Продавцы Цикл

		Поле = ПолеСтроки("Продавцы", СтрокаТаблицы, "Продавец");
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Продавец) Тогда
			СообщитьОбОшибке(НСтр("ru = 'Не заполнен продавец.'"), Поле, Отказ);
			Продолжить;
		КонецЕсли;

		ПерваяСтрока = ПервыеСтрокиПродавцов[СтрокаТаблицы.Продавец];
		Если ПерваяСтрока = Неопределено Тогда
			ПервыеСтрокиПродавцов.Вставить(СтрокаТаблицы.Продавец, СтрокаТаблицы.НомерСтроки);
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Продавец в строке № %1 совпадает со строкой № %2.'"),
				ПерваяСтрока, СтрокаТаблицы.НомерСтроки);
			СообщитьОбОшибке(ТекстСообщения, Поле, Отказ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура СообщитьОбОшибке(ТекстСообщения, Поле, Отказ)
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, "Объект", Отказ);
КонецПроцедуры

Функция ПолеСтроки(ИмяТаблицы, СтрокаТаблицы, ИмяКолонки)
	Возврат ИмяТаблицы + "[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "]." + ИмяКолонки;
КонецФункции

#КонецОбласти

#Область КассовыеОрдера

// Контекст работы с ордерами одной ведомости: данные, общие для всех ордеров, читаются один раз.
Функция НовыйКонтекстОрдеров(Ведомость)

	Контекст = Новый Структура;
	Контекст.Вставить("Ведомость", Ведомость);
	// Структура (Ссылка, Организация) либо Неопределено, если кассы нет. Отсутствие кассы -
	// ошибка, только когда ордер действительно нужно создать (см. КассаОрганизации).
	Контекст.Вставить("Касса", НайтиКассуОрганизации(Ведомость.КассаККМ));
	// Наименование статьи ДДС -> СправочникСсылка.СтатьиДвиженияДенежныхСредств.
	Контекст.Вставить("СтатьиДДС", Новый Соответствие);
	// ТаблицаЗначений из СостояниеСвязанныхОрдеров; заполняется только при синхронизации ордеров.
	Контекст.Вставить("СостояниеОрдеров", Неопределено);

	Возврат Контекст;

КонецФункции

// Сумма, пометка удаления и контрагент ордеров, на которые ведомость уже ссылается, - одним запросом.
Функция СостояниеСвязанныхОрдеров(Ведомость)

	РКО = Ведомость.ОплатаПоставщику.ВыгрузитьКолонку("РКО");
	РКО.Добавить(Ведомость.РасходыОтдела_РКО);
	РКО.Добавить(Ведомость.ЗП_Продавца_РКО);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РКО.Ссылка КАК Ссылка,
	|	РКО.СуммаДокумента КАК СуммаДокумента,
	|	РКО.ПометкаУдаления КАК ПометкаУдаления,
	|	РКО.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РКО
	|ГДЕ
	|	РКО.Ссылка В (&РКО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПКО.Ссылка,
	|	ПКО.СуммаДокумента,
	|	ПКО.ПометкаУдаления,
	|	ПКО.Контрагент
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПКО
	|ГДЕ
	|	ПКО.Ссылка = &ПКОНеучтено");
	Запрос.УстановитьПараметр("РКО", РКО);
	Запрос.УстановитьПараметр("ПКОНеучтено", Ведомость.ВедомостьПродажНеУчтено_ПКО);

	Состояние = Запрос.Выполнить().Выгрузить();
	Состояние.Индексы.Добавить("Ссылка");

	Возврат Состояние;

КонецФункции

// Статьи расшифровки платежа и хозяйственные операции перенесены из прежнего кода как есть.
Функция НовоеОписаниеОрдера(ИмяДокумента, ХозяйственнаяОперация, СтатьяДДС, Проводить = Истина)

	Описание = Новый Структура;
	Описание.Вставить("ИмяДокумента", ИмяДокумента);
	// Наименование статьи движения денежных средств в расшифровке платежа.
	Описание.Вставить("СтатьяДДС", СтатьяДДС);
	Описание.Вставить("Проводить", Проводить);
	// Реквизиты, которые заполняются при создании ордера. У созданного ордера потом
	// актуализируются сумма и, если он есть в описании, контрагент.
	Описание.Вставить("Реквизиты", Новый Структура("ХозяйственнаяОперация", ХозяйственнаяОперация));

	Возврат Описание;

КонецФункции

Функция ОписаниеПКОВыручки(Ведомость, Выемка)

	Описание = НовоеОписаниеОрдера("ПриходныйКассовыйОрдер",
		Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ, "Прочие доходы");
	Описание.Реквизиты.Вставить("КассаККМ", Ведомость.КассаККМ);
	Описание.Реквизиты.Вставить("ДокументОснование", Выемка);
	Описание.Реквизиты.Вставить("Приложение", ПолучитьСтатьяДДСНал());
	Описание.Реквизиты.Вставить("Комментарий", Ведомость.ВыручкаЗаСменуПоКассе_Комментарий);

	Возврат Описание;

КонецФункции

Функция ОписаниеПКОНеучтено(Ведомость)

	Описание = НовоеОписаниеОрдера("ПриходныйКассовыйОрдер",
		Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ, "Прочие доходы");
	Описание.Реквизиты.Вставить("КассаККМ", Ведомость.КассаККМ);
	Описание.Реквизиты.Вставить("Приложение", ПолучитьСтатьяДДСНеучтенка());
	Описание.Реквизиты.Вставить("Комментарий", Ведомость.ВедомостьПродажнеНеУчтено_Комментарий);
	// ПКО неучтенки привязывается к первой выемке; без выемки запись не пропустит проверка.
	Если Ведомость.ВыемкаДенежныхСредств.Количество() > 0 Тогда
		Описание.Реквизиты.Вставить("ДокументОснование", Ведомость.ВыемкаДенежныхСредств[0].Выемка);
	КонецЕсли;

	Возврат Описание;

КонецФункции

Функция ОписаниеРКОПоставщику(Контрагент)

	Описание = НовоеОписаниеОрдера("РасходныйКассовыйОрдер",
		Перечисления.ХозяйственныеОперации.ОплатаПоставщику, "Прочие расходы");
	Описание.Реквизиты.Вставить("Контрагент", Контрагент);
	Описание.Реквизиты.Вставить("Приложение", ПолучитьСтатьяДДСОплатаПоставщику());

	Возврат Описание;

КонецФункции

Функция ОписаниеРКОРасходовОтдела(Ведомость)

	Описание = НовоеОписаниеОрдера("РасходныйКассовыйОрдер",
		Перечисления.ХозяйственныеОперации.ПрочиеРасходы, "Оплата поставщику");
	Описание.Реквизиты.Вставить("Комментарий", Ведомость.РасходыОтдела_Комментарий);

	Возврат Описание;

КонецФункции

Функция ОписаниеРКОЗарплаты(Ведомость)

	// Вик 2020-08-06. РКО на зарплату записывается без проведения - так было и до ревью.
	Описание = НовоеОписаниеОрдера("РасходныйКассовыйОрдер",
		Перечисления.ХозяйственныеОперации.ПрочиеРасходы, "Оплата поставщику", Ложь);
	Описание.Реквизиты.Вставить("Приложение", "2.2.1 ЗП");
	Описание.Реквизиты.Вставить("Комментарий", Ведомость.ЗП_Продаца_Комментарий);

	Возврат Описание;

КонецФункции

// Возвращает ордер, соответствующий сумме: при нулевой сумме помечает прежний ордер на удаление,
// при заполненной - обновляет существующий или создает новый (в том числе вместо битой ссылки).
Функция АктуальныйКассовыйОрдер(Контекст, Знач Ордер, Знач Сумма, Знач Описание)

	ТекущиеЗначения = Контекст.СостояниеОрдеров.Найти(Ордер, "Ссылка");

	Если Не ЗначениеЗаполнено(Сумма) Тогда
		Если ТекущиеЗначения <> Неопределено И Не ТекущиеЗначения.ПометкаУдаления Тогда
			ПометитьКассовыйОрдерНаУдаление(Ордер);
		КонецЕсли;
		Возврат Документы[Описание.ИмяДокумента].ПустаяСсылка();
	ИначеЕсли ТекущиеЗначения <> Неопределено Тогда
		ОбновитьКассовыйОрдер(Ордер, Сумма, Описание, ТекущиеЗначения);
		Возврат Ордер;
	Иначе
		Возврат СоздатьКассовыйОрдер(Контекст, Описание, Сумма);
	КонецЕсли;

КонецФункции

Функция СоздатьКассовыйОрдер(Контекст, Знач Описание, Знач Сумма)

	Касса = КассаОрганизации(Контекст);

	Ордер = Документы[Описание.ИмяДокумента].СоздатьДокумент();
	Ордер.Дата = ?(ЗначениеЗаполнено(Контекст.Ведомость.Дата), Контекст.Ведомость.Дата, ТекущаяДатаСеанса());
	Ордер.Касса = Касса.Ссылка;
	Ордер.Организация = Касса.Организация;
	Ордер.СуммаДокумента = Сумма;
	ЗаполнитьЗначенияСвойств(Ордер, Описание.Реквизиты);

	СтрокаРасшифровки = Ордер.РасшифровкаПлатежа.Добавить();
	СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств = СтатьяДДС(Контекст, Описание.СтатьяДДС);
	СтрокаРасшифровки.Сумма = Сумма;

	Ордер.Записать(?(Описание.Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));

	Возврат Ордер.Ссылка;

КонецФункции

Процедура ОбновитьКассовыйОрдер(Знач Ордер, Знач Сумма, Знач Описание, Знач ТекущиеЗначения)

	// Ордер, помеченный на удаление вручную, не трогаем.
	Если ТекущиеЗначения.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Контрагент = Неопределено;
	СверятьКонтрагента = Описание.Реквизиты.Свойство("Контрагент", Контрагент);
	СменилсяКонтрагент = СверятьКонтрагента И ТекущиеЗначения.Контрагент <> Контрагент;
	Если ТекущиеЗначения.СуммаДокумента = Сумма И Не СменилсяКонтрагент Тогда
		Возврат;
	КонецЕсли;

	ОрдерОбъект = Ордер.ПолучитьОбъект();
	ОрдерОбъект.СуммаДокумента = Сумма;
	Если СверятьКонтрагента Тогда
		ОрдерОбъект.Контрагент = Контрагент;
	КонецЕсли;
	Если ОрдерОбъект.РасшифровкаПлатежа.Количество() > 0 Тогда
		ОрдерОбъект.РасшифровкаПлатежа[0].Сумма = Сумма;
	КонецЕсли;
	ОрдерОбъект.Записать(?(ОрдерОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));

КонецПроцедуры

// Проведенный ордер при установке пометки удаления платформа распроводит сама.
Процедура ПометитьКассовыйОрдерНаУдаление(Ордер)

	ОрдерОбъект = Ордер.ПолучитьОбъект();
	Если ОрдерОбъект <> Неопределено Тогда
		ОрдерОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;

КонецПроцедуры

// Помечает на удаление РКО строк оплаты поставщикам, которые удалили из ведомости.
// Прежний состав строк читается из базы: ведомость в ней еще не перезаписана.
Процедура ПометитьНаУдалениеРКОУдаленныхСтрок(Ведомость)

	Если Ведомость.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТБК_ВедомостьОПродажахЗаДеньОплатаПоставщику.РКО КАК РКО
	|ИЗ
	|	Документ.ТБК_ВедомостьОПродажахЗаДень.ОплатаПоставщику КАК ТБК_ВедомостьОПродажахЗаДеньОплатаПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ПО (РасходныйКассовыйОрдер.Ссылка = ТБК_ВедомостьОПродажахЗаДеньОплатаПоставщику.РКО)
	|ГДЕ
	|	ТБК_ВедомостьОПродажахЗаДеньОплатаПоставщику.Ссылка = &Ссылка
	|	И НЕ ТБК_ВедомостьОПродажахЗаДеньОплатаПоставщику.РКО В (&ОставшиесяРКО)
	|	И НЕ РасходныйКассовыйОрдер.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", Ведомость.Ссылка);
	Запрос.УстановитьПараметр("ОставшиесяРКО", Ведомость.ОплатаПоставщику.ВыгрузитьКолонку("РКО"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПометитьКассовыйОрдерНаУдаление(Выборка.РКО);
	КонецЦикла;

КонецПроцедуры

Функция КассаОрганизации(Контекст)

	Если Контекст.Касса = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Для кассы ККМ ""%1"" не найдена касса в справочнике ""Кассы"", кассовый ордер создать нельзя.'"),
			Контекст.Ведомость.КассаККМ);
	КонецЕсли;

	Возврат Контекст.Касса;

КонецФункции

// Касса организации, к которой относится касса ККМ. Непомеченная на удаление - в приоритете.
Функция НайтиКассуОрганизации(КассаККМ)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Кассы.Ссылка КАК Ссылка,
	|	Кассы.Владелец КАК Организация
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.КассаККМ = &КассаККМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Кассы.ПометкаУдаления");
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Ссылка, Организация", Выборка.Ссылка, Выборка.Организация);

КонецФункции

Функция СтатьяДДС(Контекст, Наименование)

	Статья = Контекст.СтатьиДДС[Наименование];
	Если Статья = Неопределено Тогда
		Статья = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(Наименование);
		Контекст.СтатьиДДС.Вставить(Наименование, Статья);
	КонецЕсли;

	Возврат Статья;

КонецФункции

#КонецОбласти

Функция ИмяСобытияЖурнала()
	Возврат НСтр("ru = 'ТБК.Ведомость о продажах за день'", ОбщегоНазначения.КодОсновногоЯзыка());
КонецФункции

#КонецОбласти

#КонецЕсли
